Python 3.9.1 (tags/v3.9.1:1e5d33e, Dec  7 2020, 17:08:21) [MSC v.1927 64 bit (AMD64)] on win32
Type "help", "copyright", "credits" or "license()" for more information.
>>> # 가위바위보 게임
>>> 
========== RESTART: C:/Users/bee64/Desktop/python/04.참과 거짓, 조건/Game.py =========
## 안나와 신후의 가위, 바위, 보 게임 ##
안나를 위한 가위, 바위, 보를 입력하세요 : 가위
신후를 위한 가위, 바위, 보를 입력하세요 : 가위
무승부
>>> 
========== RESTART: C:/Users/bee64/Desktop/python/04.참과 거짓, 조건/Game.py =========
## 안나와 신후의 가위, 바위, 보 게임 ##
안나를 위한 가위, 바위, 보를 입력하세요 : 가위
신후를 위한 가위, 바위, 보를 입력하세요 : 보
안나 승리
>>> 
========== RESTART: C:/Users/bee64/Desktop/python/04.참과 거짓, 조건/Game.py =========
## 안나와 신후의 가위, 바위, 보 게임 ##
안나를 위한 가위, 바위, 보를 입력하세요 : 잉
신후를 위한 가위, 바위, 보를 입력하세요 : 잉
안나 값 입력 오류 : 잉
>>> 
========== RESTART: C:/Users/bee64/Desktop/python/04.참과 거짓, 조건/Game.py =========
## 안나와 신후의 가위, 바위, 보 게임 ##
안나를 위한 가위, 바위, 보를 입력하세요 : 보
신후를 위한 가위, 바위, 보를 입력하세요 : 바잉
Traceback (most recent call last):
  File "C:/Users/bee64/Desktop/python/04.참과 거짓, 조건/Game.py", line 27, in <module>
    elif (Ana == '보' and Shinfu -- '가위'):
TypeError: bad operand type for unary -: 'str'
>>> 
========== RESTART: C:/Users/bee64/Desktop/python/04.참과 거짓, 조건/Game.py =========
## 안나와 신후의 가위, 바위, 보 게임 ##
안나를 위한 가위, 바위, 보를 입력하세요 : 보
신후를 위한 가위, 바위, 보를 입력하세요 : 바잉
안나 값 입력 오류 : 보
>>> 
========== RESTART: C:/Users/bee64/Desktop/python/04.참과 거짓, 조건/Game.py =========
## 안나와 신후의 가위, 바위, 보 게임 ##
안나를 위한 가위, 바위, 보를 입력하세요 : 바위
신후를 위한 가위, 바위, 보를 입력하세요 : 바위
무승부
>>> 
========== RESTART: C:/Users/bee64/Desktop/python/04.참과 거짓, 조건/Game.py =========
## 안나와 신후의 가위, 바위, 보 게임 ##
안나를 위한 가위, 바위, 보를 입력하세요 : 바위
신후를 위한 가위, 바위, 보를 입력하세요 : 가이
안나 값 입력 오류 : 바위
>>> 
========== RESTART: C:/Users/bee64/Desktop/python/04.참과 거짓, 조건/Game.py =========
## 안나와 신후의 가위, 바위, 보 게임 ##
안나를 위한 가위, 바위, 보를 입력하세요 : 보
신후를 위한 가위, 바위, 보를 입력하세요 : 바이
안나 값 입력 오류 : 보
>>> 
========== RESTART: C:/Users/bee64/Desktop/python/04.참과 거짓, 조건/Game.py =========
## 안나와 신후의 가위, 바위, 보 게임 ##
안나를 위한 가위, 바위, 보를 입력하세요 : ㅇ
신후를 위한 가위, 바위, 보를 입력하세요 : 바위
안나 값 입력 오류 : ㅇ
>>> 
========== RESTART: C:/Users/bee64/Desktop/python/04.참과 거짓, 조건/Game.py =========
## 안나와 신후의 가위, 바위, 보 게임 ##
안나를 위한 가위, 바위, 보를 입력하세요 : ㅇ
신후를 위한 가위, 바위, 보를 입력하세요 : ㅇ
안나 값 입력 오류 : ㅇ
>>> 
========== RESTART: C:/Users/bee64/Desktop/python/04.참과 거짓, 조건/Game.py =========
## 안나와 신후의 가위, 바위, 보 게임 ##
안나를 위한 가위, 바위, 보를 입력하세요 : 바위
신후를 위한 가위, 바위, 보를 입력하세요 : ㅇ
안나 값 입력 오류 : 바위
>>> 
========== RESTART: C:/Users/bee64/Desktop/python/04.참과 거짓, 조건/Game.py =========
## 안나와 신후의 가위, 바위, 보 게임 ##
안나를 위한 가위, 바위, 보를 입력하세요 : 보
신후를 위한 가위, 바위, 보를 입력하세요 : ㅇ
신후 값 입력 오류 ㅇ
>>> 
========== RESTART: C:/Users/bee64/Desktop/python/04.참과 거짓, 조건/Game.py =========
## 안나와 신후의 가위, 바위, 보 게임 ##
안나를 위한 가위, 바위, 보를 입력하세요 : 보
신후를 위한 가위, 바위, 보를 입력하세요 : ㅇ
안나 값 입력 오류 : 보
>>> 
========== RESTART: C:/Users/bee64/Desktop/python/04.참과 거짓, 조건/Game.py =========
## 안나와 신후의 가위, 바위, 보 게임 ##
안나를 위한 가위, 바위, 보를 입력하세요 : 보
신후를 위한 가위, 바위, 보를 입력하세요 : ㅇ
안나 값 입력 오류 : 보
>>> 
========== RESTART: C:/Users/bee64/Desktop/python/04.참과 거짓, 조건/Game.py =========
## 안나와 신후의 가위, 바위, 보 게임 ##
안나를 위한 가위, 바위, 보를 입력하세요 : 바위
신후를 위한 가위, 바위, 보를 입력하세요 : 바이
안나 값 입력 오류 : 바위
>>> 
========== RESTART: C:/Users/bee64/Desktop/python/04.참과 거짓, 조건/Game.py =========
## 안나와 신후의 가위, 바위, 보 게임 ##
안나를 위한 가위, 바위, 보를 입력하세요 : 바위
신후를 위한 가위, 바위, 보를 입력하세요 : ㅇ
안나 값 입력 오류 : 바위
>>> 
========== RESTART: C:/Users/bee64/Desktop/python/04.참과 거짓, 조건/Game.py =========
## 안나와 신후의 가위, 바위, 보 게임 ##
안나를 위한 가위, 바위, 보를 입력하세요 : 보
신후를 위한 가위, 바위, 보를 입력하세요 : ㅇ
안나 값 입력 오류 : 보
>>> 
========== RESTART: C:/Users/bee64/Desktop/python/04.참과 거짓, 조건/Game.py =========
## 안나와 신후의 가위, 바위, 보 게임 ##
안나를 위한 가위, 바위, 보를 입력하세요 : 보
신후를 위한 가위, 바위, 보를 입력하세요 : ㅇ
'가위, 바위, 보'로 입력하시오.
>>> 보
Traceback (most recent call last):
  File "<pyshell#1>", line 1, in <module>
    보
NameError: name '보' is not defined
>>> 
========== RESTART: C:/Users/bee64/Desktop/python/04.참과 거짓, 조건/Game.py =========
## 안나와 신후의 가위, 바위, 보 게임 ##
안나를 위한 가위, 바위, 보를 입력하세요 : 가위
신후를 위한 가위, 바위, 보를 입력하세요 : 보
안나 승리
>>> 
========== RESTART: C:/Users/bee64/Desktop/python/04.참과 거짓, 조건/Game.py =========
## 안나와 신후의 가위, 바위, 보 게임 ##
안나를 위한 가위, 바위, 보를 입력하세요 : 가위
신후를 위한 가위, 바위, 보를 입력하세요 : 가이
'가위, 바위, 보'로 입력하시오.
>>> 
========== RESTART: C:/Users/bee64/Desktop/python/04.참과 거짓, 조건/Game.py =========
## 안나와 신후의 가위, 바위, 보 게임 ##
안나를 위한 가위, 바위, 보를 입력하세요 : 가위 바위
신후를 위한 가위, 바위, 보를 입력하세요 : 가위
'가위', '바위', '보'중 하나를 입력하시오.
>>> 
========== RESTART: C:/Users/bee64/Desktop/python/04.참과 거짓, 조건/Game.py =========
## 안나와 신후의 가위, 바위, 보 게임 ##
안나를 위한 가위, 바위, 보를 입력하세요 : 잉
신후를 위한 가위, 바위, 보를 입력하세요 : 바위
'가위', '바위', '보'중 하나 입력하시오.
>>> 